src/cfe/АвтоматизацияРУтины/Enums/Ар_ТипыРасположенияИнформационныйБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<Enum>
		<Properties>
			<Name>Ар_ТипыРасположенияИнформационныйБазы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаДанномКомпьютереИлиНаКомпьютереВЛокальнойСети</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВебСервере</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСервере1СПредприятия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/АвтоматизацияРУтины/Catalogs/Ар_ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Ар_ИнформационныеБазы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасположенияИнформационныйБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Ар_ТипыРасположенияИнформационныйБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ар_Хранилища</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеПараметрыЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Ар_Разрядность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КластерСерверов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИнформационнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРежимЗапуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Ар_РежимЗапуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/АвтоматизацияРУтины/CommonModules/Ар_ИнформационныеБазы/Ext/Module.bsl
Функция ПолучитьПараметрыКластера(База, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОтказКластера		= Ложь;
	ОшибкаКластера		= "";
	ОтказИБ				= Ложь;
	ОшибкаИБ			= "";
	Данные 				= Новый Структура("ПараметрыКластера, ПараметрыИБ, ОшибкаИБ, ОшибкаКластера, ОтказИБ, ОтказКластера, Отказ");
	ДанныеКоманды 		= Справочники.Ар_ИнформационныеБазы.ПолучитьДанныеВыполненияКомандыКонфигурации(База, "");
	МассивИмяКластера 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДанныеКоманды.РасположениеИС.Кластер, ":");
	
	Если ДанныеКоманды.РасположениеИС.Тип = Перечисления.Ар_ТипыРасположенияИнформационныйБазы.НаСервере1СПредприятия Тогда
		
		ПараметрыКластера 									= АдминистрированиеКластера.ПараметрыАдминистрированияКластера();
		ПараметрыКластера.ТипПодключения 					= "COM";
		ПараметрыКластера.АдресАгентаСервера                = ДанныеКоманды.РасположениеИС.Кластер;
		ПараметрыКластера.АдресСервераАдминистрирования     = ДанныеКоманды.РасположениеИС.Кластер;
		
		Если МассивИмяКластера.Количество() = 2 Тогда
			ПараметрыКластера.ПортКластера                  = МассивИмяКластера[1];
		КонецЕсли;
		
		ПараметрыИБ											= АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
		ПараметрыИБ.ИмяВКластере                            = ДанныеКоманды.РасположениеИС.ИмяИС;
		ПараметрыИБ.ИмяАдминистратораИнформационнойБазы     = ДанныеКоманды.Авторизация.Логин;
		ПараметрыИБ.ПарольАдминистратораИнформационнойБазы  = ДанныеКоманды.Авторизация.Пароль;
		
		Если ДополнительныеПараметры <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыКластера, ДополнительныеПараметры);
		КонецЕсли;
		
		//проверим администрирования ИБ
		Попытка
			АдминистрированиеКластера.ПроверитьПараметрыАдминистрирования(ПараметрыКластера, ПараметрыИБ, Ложь, Истина);
		Исключение
			ОтказИБ 		= Истина;
			ОшибкаКластера 	= ИнформацияОбОшибке().Описание;
		КонецПопытки;
		
		//проверим администрирования кластера
		Попытка
			АдминистрированиеКластера.ПроверитьПараметрыАдминистрирования(ПараметрыКластера, ПараметрыИБ, Истина, Ложь);
		Исключение
			ОтказКластера 	= Истина;
			ОшибкаИБ 		= ИнформацияОбОшибке().Описание;
		КонецПопытки;
		
		Данные.ПараметрыКластера 	= ПараметрыКластера;
		Данные.ПараметрыИБ 			= ПараметрыИБ;
		
	КонецЕсли;
	
	Данные.ОтказКластера 		= ОтказКластера;
	Данные.ОшибкаКластера 		= ОшибкаКластера;
	Данные.ОтказИБ 				= ОтказИБ;
	Данные.ОшибкаИБ 			= ОшибкаИБ;
	Данные.Отказ				= ОтказКластера Или ОтказИБ;
	
	Возврат Данные;
	
КонецФункции
